# KipDashFt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KipDashFt Property
SymbolTypeId Class See Also
---
Symbol kip-ft, indicating unit Kip feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipDashFt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipDashFt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipDashFt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace